apache/nuttx/arch/risc-v/src/esp32c6/hardware/esp32c6_systimer.h
#define SYSTIMER_TIMER_UNIT0_VALUE_VALID    (BIT(29))
#define SYSTIMER_TIMER_UNIT0_VALUE_VALID_M  (SYSTIMER_TIMER_UNIT0_VALUE_VALID_V << SYSTIMER_TIMER_UNIT0_VALUE_VALID_S)
#define SYSTIMER_TIMER_UNIT0_VALUE_VALID_V  0x00000001
#define SYSTIMER_TIMER_UNIT0_VALUE_VALID_S  29

/* SYSTIMER_UNIT1_OP_REG register
 * system timer unit1 value update register
 */

#define SYSTIMER_UNIT1_OP_REG (DR_REG_SYSTIMER_BASE + 0x8)

/* SYSTIMER_TIMER_UNIT1_UPDATE : WT; bitpos: [30]; default: 0;
 * update timer unit1
 */

#define SYSTIMER_TIMER_UNIT1_UPDATE    (BIT(30))
#define SYSTIMER_TIMER_UNIT1_UPDATE_M  (SYSTIMER_TIMER_UNIT1_UPDATE_V << SYSTIMER_TIMER_UNIT1_UPDATE_S)
#define SYSTIMER_TIMER_UNIT1_UPDATE_V  0x00000001
#define SYSTIMER_TIMER_UNIT1_UPDATE_S  30

/* SYSTIMER_TIMER_UNIT1_VALUE_VALID : R/SS/WTC; bitpos: [29]; default: 0;
 * timer value is sync and valid
 */

#define SYSTIMER_TIMER_UNIT1_VALUE_VALID    (BIT(29))
#define SYSTIMER_TIMER_UNIT1_VALUE_VALID_M  (SYSTIMER_TIMER_UNIT1_VALUE_VALID_V << SYSTIMER_TIMER_UNIT1_VALUE_VALID_S)
#define SYSTIMER_TIMER_UNIT1_VALUE_VALID_V  0x00000001
#define SYSTIMER_TIMER_UNIT1_VALUE_VALID_S  29

/* SYSTIMER_UNIT0_LOAD_HI_REG register
 * system timer unit0 value high load register
 */

#define SYSTIMER_UNIT0_LOAD_HI_REG (DR_REG_SYSTIMER_BASE + 0xc)

/* SYSTIMER_TIMER_UNIT0_LOAD_HI : R/W; bitpos: [19:0]; default: 0;
 * timer unit0 load high 20 bits
 */

#define SYSTIMER_TIMER_UNIT0_LOAD_HI    0x000fffff
#define SYSTIMER_TIMER_UNIT0_LOAD_HI_M  (SYSTIMER_TIMER_UNIT0_LOAD_HI_V << SYSTIMER_TIMER_UNIT0_LOAD_HI_S)
#define SYSTIMER_TIMER_UNIT0_LOAD_HI_V  0x000fffff
#define SYSTIMER_TIMER_UNIT0_LOAD_HI_S  0

/* SYSTIMER_UNIT0_LOAD_LO_REG register
 * system timer unit0 value low load register
 */

#define SYSTIMER_UNIT0_LOAD_LO_REG (DR_REG_SYSTIMER_BASE + 0x10)

/* SYSTIMER_TIMER_UNIT0_LOAD_LO : R/W; bitpos: [31:0]; default: 0;
 * timer unit0 load low 32 bits
 */

#define SYSTIMER_TIMER_UNIT0_LOAD_LO    0xffffffff
#define SYSTIMER_TIMER_UNIT0_LOAD_LO_M  (SYSTIMER_TIMER_UNIT0_LOAD_LO_V << SYSTIMER_TIMER_UNIT0_LOAD_LO_S)
#define SYSTIMER_TIMER_UNIT0_LOAD_LO_V  0xffffffff
#define SYSTIMER_TIMER_UNIT0_LOAD_LO_S  0

/* SYSTIMER_UNIT1_LOAD_HI_REG register
 * system timer unit1 value high load register
 */

#define SYSTIMER_UNIT1_LOAD_HI_REG (DR_REG_SYSTIMER_BASE + 0x14)

/* SYSTIMER_TIMER_UNIT1_LOAD_HI : R/W; bitpos: [19:0]; default: 0;
 * timer unit1 load high 20 bits
 */

#define SYSTIMER_TIMER_UNIT1_LOAD_HI    0x000fffff
#define SYSTIMER_TIMER_UNIT1_LOAD_HI_M  (SYSTIMER_TIMER_UNIT1_LOAD_HI_V << SYSTIMER_TIMER_UNIT1_LOAD_HI_S)
#define SYSTIMER_TIMER_UNIT1_LOAD_HI_V  0x000fffff
#define SYSTIMER_TIMER_UNIT1_LOAD_HI_S  0

/* SYSTIMER_UNIT1_LOAD_LO_REG register
 * system timer unit1 value low load register
 */

#define SYSTIMER_UNIT1_LOAD_LO_REG (DR_REG_SYSTIMER_BASE + 0x18)

/* SYSTIMER_TIMER_UNIT1_LOAD_LO : R/W; bitpos: [31:0]; default: 0;
 * timer unit1 load low 32 bits
 */

#define SYSTIMER_TIMER_UNIT1_LOAD_LO    0xffffffff
#define SYSTIMER_TIMER_UNIT1_LOAD_LO_M  (SYSTIMER_TIMER_UNIT1_LOAD_LO_V << SYSTIMER_TIMER_UNIT1_LOAD_LO_S)
#define SYSTIMER_TIMER_UNIT1_LOAD_LO_V  0xffffffff
#define SYSTIMER_TIMER_UNIT1_LOAD_LO_S  0

/* SYSTIMER_TARGET0_HI_REG register
 * system timer comp0 value high register
 */

#define SYSTIMER_TARGET0_HI_REG (DR_REG_SYSTIMER_BASE + 0x1c)

/* SYSTIMER_TIMER_TARGET0_HI : R/W; bitpos: [19:0]; default: 0;
 * timer taget0 high 20 bits
 */

#define SYSTIMER_TIMER_TARGET0_HI    0x000fffff
#define SYSTIMER_TIMER_TARGET0_HI_M  (SYSTIMER_TIMER_TARGET0_HI_V << SYSTIMER_TIMER_TARGET0_HI_S)
#define SYSTIMER_TIMER_TARGET0_HI_V  0x000fffff
#define SYSTIMER_TIMER_TARGET0_HI_S  0

/* SYSTIMER_TARGET0_LO_REG register
 * system timer comp0 value low register
 */

#define SYSTIMER_TARGET0_LO_REG (DR_REG_SYSTIMER_BASE + 0x20)

/* SYSTIMER_TIMER_TARGET0_LO : R/W; bitpos: [31:0]; default: 0;
 * timer taget0 low 32 bits
 */

#define SYSTIMER_TIMER_TARGET0_LO    0xffffffff
#define SYSTIMER_TIMER_TARGET0_LO_M  (SYSTIMER_TIMER_TARGET0_LO_V << SYSTIMER_TIMER_TARGET0_LO_S)
#define SYSTIMER_TIMER_TARGET0_LO_V  0xffffffff
#define SYSTIMER_TIMER_TARGET0_LO_S  0

/* SYSTIMER_TARGET1_HI_REG register
 * system timer comp1 value high register
 */

#define SYSTIMER_TARGET1_HI_REG (DR_REG_SYSTIMER_BASE + 0x24)

/* SYSTIMER_TIMER_TARGET1_HI : R/W; bitpos: [19:0]; default: 0;
 * timer taget1 high 20 bits
 */

#define SYSTIMER_TIMER_TARGET1_HI    0x000fffff
#define SYSTIMER_TIMER_TARGET1_HI_M  (SYSTIMER_TIMER_TARGET1_HI_V << SYSTIMER_TIMER_TARGET1_HI_S)
#define SYSTIMER_TIMER_TARGET1_HI_V  0x000fffff
#define SYSTIMER_TIMER_TARGET1_HI_S  0

/* SYSTIMER_TARGET1_LO_REG register
 * system timer comp1 value low register
 */

#define SYSTIMER_TARGET1_LO_REG (DR_REG_SYSTIMER_BASE + 0x28)

/* SYSTIMER_TIMER_TARGET1_LO : R/W; bitpos: [31:0]; default: 0;
 * timer taget1 low 32 bits
 */

#define SYSTIMER_TIMER_TARGET1_LO    0xffffffff
#define SYSTIMER_TIMER_TARGET1_LO_M  (SYSTIMER_TIMER_TARGET1_LO_V << SYSTIMER_TIMER_TARGET1_LO_S)
#define SYSTIMER_TIMER_TARGET1_LO_V  0xffffffff
#define SYSTIMER_TIMER_TARGET1_LO_S  0

/* SYSTIMER_TARGET2_HI_REG register
 * system timer comp2 value high register
 */

#define SYSTIMER_TARGET2_HI_REG (DR_REG_SYSTIMER_BASE + 0x2c)

/* SYSTIMER_TIMER_TARGET2_HI : R/W; bitpos: [19:0]; default: 0;
 * timer taget2 high 20 bits
 */

#define SYSTIMER_TIMER_TARGET2_HI    0x000fffff
#define SYSTIMER_TIMER_TARGET2_HI_M  (SYSTIMER_TIMER_TARGET2_HI_V << SYSTIMER_TIMER_TARGET2_HI_S)
#define SYSTIMER_TIMER_TARGET2_HI_V  0x000fffff
#define SYSTIMER_TIMER_TARGET2_HI_S  0

/* SYSTIMER_TARGET2_LO_REG register
 * system timer comp2 value low register
 */

#define SYSTIMER_TARGET2_LO_REG (DR_REG_SYSTIMER_BASE + 0x30)

/* SYSTIMER_TIMER_TARGET2_LO : R/W; bitpos: [31:0]; default: 0;
 * timer taget2 low 32 bits
 */

#define SYSTIMER_TIMER_TARGET2_LO    0xffffffff
#define SYSTIMER_TIMER_TARGET2_LO_M  (SYSTIMER_TIMER_TARGET2_LO_V << SYSTIMER_TIMER_TARGET2_LO_S)
#define SYSTIMER_TIMER_TARGET2_LO_V  0xffffffff
#define SYSTIMER_TIMER_TARGET2_LO_S  0

/* SYSTIMER_TARGET0_CONF_REG register
 * system timer comp0 target mode register
 */

