apache/nuttx/arch/risc-v/src/esp32c6/hardware/esp32c6_systimer.h
#define SYSTIMER_TIMER_COMP1_LOAD    (BIT(0))
#define SYSTIMER_TIMER_COMP1_LOAD_M  (SYSTIMER_TIMER_COMP1_LOAD_V << SYSTIMER_TIMER_COMP1_LOAD_S)
#define SYSTIMER_TIMER_COMP1_LOAD_V  0x00000001
#define SYSTIMER_TIMER_COMP1_LOAD_S  0

/* SYSTIMER_COMP2_LOAD_REG register
 * system timer comp2 conf sync register
 */

#define SYSTIMER_COMP2_LOAD_REG (DR_REG_SYSTIMER_BASE + 0x58)

/* SYSTIMER_TIMER_COMP2_LOAD : WT; bitpos: [0]; default: 0;
 * timer comp2 sync enable signal
 */

#define SYSTIMER_TIMER_COMP2_LOAD    (BIT(0))
#define SYSTIMER_TIMER_COMP2_LOAD_M  (SYSTIMER_TIMER_COMP2_LOAD_V << SYSTIMER_TIMER_COMP2_LOAD_S)
#define SYSTIMER_TIMER_COMP2_LOAD_V  0x00000001
#define SYSTIMER_TIMER_COMP2_LOAD_S  0

/* SYSTIMER_UNIT0_LOAD_REG register
 * system timer unit0 conf sync register
 */

#define SYSTIMER_UNIT0_LOAD_REG (DR_REG_SYSTIMER_BASE + 0x5c)

/* SYSTIMER_TIMER_UNIT0_LOAD : WT; bitpos: [0]; default: 0;
 * timer unit0 sync enable signal
 */

#define SYSTIMER_TIMER_UNIT0_LOAD    (BIT(0))
#define SYSTIMER_TIMER_UNIT0_LOAD_M  (SYSTIMER_TIMER_UNIT0_LOAD_V << SYSTIMER_TIMER_UNIT0_LOAD_S)
#define SYSTIMER_TIMER_UNIT0_LOAD_V  0x00000001
#define SYSTIMER_TIMER_UNIT0_LOAD_S  0

/* SYSTIMER_UNIT1_LOAD_REG register
 * system timer unit1 conf sync register
 */

#define SYSTIMER_UNIT1_LOAD_REG (DR_REG_SYSTIMER_BASE + 0x60)

/* SYSTIMER_TIMER_UNIT1_LOAD : WT; bitpos: [0]; default: 0;
 * timer unit1 sync enable signal
 */

#define SYSTIMER_TIMER_UNIT1_LOAD    (BIT(0))
#define SYSTIMER_TIMER_UNIT1_LOAD_M  (SYSTIMER_TIMER_UNIT1_LOAD_V << SYSTIMER_TIMER_UNIT1_LOAD_S)
#define SYSTIMER_TIMER_UNIT1_LOAD_V  0x00000001
#define SYSTIMER_TIMER_UNIT1_LOAD_S  0

/* SYSTIMER_INT_ENA_REG register
 * systimer interrupt enable register
 */

#define SYSTIMER_INT_ENA_REG (DR_REG_SYSTIMER_BASE + 0x64)

/* SYSTIMER_TARGET2_INT_ENA : R/W; bitpos: [2]; default: 0;
 * interupt2 enable
 */

#define SYSTIMER_TARGET2_INT_ENA    (BIT(2))
#define SYSTIMER_TARGET2_INT_ENA_M  (SYSTIMER_TARGET2_INT_ENA_V << SYSTIMER_TARGET2_INT_ENA_S)
#define SYSTIMER_TARGET2_INT_ENA_V  0x00000001
#define SYSTIMER_TARGET2_INT_ENA_S  2

/* SYSTIMER_TARGET1_INT_ENA : R/W; bitpos: [1]; default: 0;
 * interupt1 enable
 */

#define SYSTIMER_TARGET1_INT_ENA    (BIT(1))
#define SYSTIMER_TARGET1_INT_ENA_M  (SYSTIMER_TARGET1_INT_ENA_V << SYSTIMER_TARGET1_INT_ENA_S)
#define SYSTIMER_TARGET1_INT_ENA_V  0x00000001
#define SYSTIMER_TARGET1_INT_ENA_S  1

/* SYSTIMER_TARGET0_INT_ENA : R/W; bitpos: [0]; default: 0;
 * interupt0 enable
 */

#define SYSTIMER_TARGET0_INT_ENA    (BIT(0))
#define SYSTIMER_TARGET0_INT_ENA_M  (SYSTIMER_TARGET0_INT_ENA_V << SYSTIMER_TARGET0_INT_ENA_S)
#define SYSTIMER_TARGET0_INT_ENA_V  0x00000001
#define SYSTIMER_TARGET0_INT_ENA_S  0

/* SYSTIMER_INT_RAW_REG register
 * systimer interrupt raw register
 */

#define SYSTIMER_INT_RAW_REG (DR_REG_SYSTIMER_BASE + 0x68)

/* SYSTIMER_TARGET2_INT_RAW : R/WTC/SS; bitpos: [2]; default: 0;
 * interupt2 raw
 */

#define SYSTIMER_TARGET2_INT_RAW    (BIT(2))
#define SYSTIMER_TARGET2_INT_RAW_M  (SYSTIMER_TARGET2_INT_RAW_V << SYSTIMER_TARGET2_INT_RAW_S)
#define SYSTIMER_TARGET2_INT_RAW_V  0x00000001
#define SYSTIMER_TARGET2_INT_RAW_S  2

/* SYSTIMER_TARGET1_INT_RAW : R/WTC/SS; bitpos: [1]; default: 0;
 * interupt1 raw
 */

#define SYSTIMER_TARGET1_INT_RAW    (BIT(1))
#define SYSTIMER_TARGET1_INT_RAW_M  (SYSTIMER_TARGET1_INT_RAW_V << SYSTIMER_TARGET1_INT_RAW_S)
#define SYSTIMER_TARGET1_INT_RAW_V  0x00000001
#define SYSTIMER_TARGET1_INT_RAW_S  1

/* SYSTIMER_TARGET0_INT_RAW : R/WTC/SS; bitpos: [0]; default: 0;
 * interupt0 raw
 */

#define SYSTIMER_TARGET0_INT_RAW    (BIT(0))
#define SYSTIMER_TARGET0_INT_RAW_M  (SYSTIMER_TARGET0_INT_RAW_V << SYSTIMER_TARGET0_INT_RAW_S)
#define SYSTIMER_TARGET0_INT_RAW_V  0x00000001
#define SYSTIMER_TARGET0_INT_RAW_S  0

/* SYSTIMER_INT_CLR_REG register
 * systimer interrupt clear register
 */

#define SYSTIMER_INT_CLR_REG (DR_REG_SYSTIMER_BASE + 0x6c)

/* SYSTIMER_TARGET2_INT_CLR : WT; bitpos: [2]; default: 0;
 * interupt2 clear
 */

#define SYSTIMER_TARGET2_INT_CLR    (BIT(2))
#define SYSTIMER_TARGET2_INT_CLR_M  (SYSTIMER_TARGET2_INT_CLR_V << SYSTIMER_TARGET2_INT_CLR_S)
#define SYSTIMER_TARGET2_INT_CLR_V  0x00000001
#define SYSTIMER_TARGET2_INT_CLR_S  2

/* SYSTIMER_TARGET1_INT_CLR : WT; bitpos: [1]; default: 0;
 * interupt1 clear
 */

#define SYSTIMER_TARGET1_INT_CLR    (BIT(1))
#define SYSTIMER_TARGET1_INT_CLR_M  (SYSTIMER_TARGET1_INT_CLR_V << SYSTIMER_TARGET1_INT_CLR_S)
#define SYSTIMER_TARGET1_INT_CLR_V  0x00000001
#define SYSTIMER_TARGET1_INT_CLR_S  1

/* SYSTIMER_TARGET0_INT_CLR : WT; bitpos: [0]; default: 0;
 * interupt0 clear
 */

#define SYSTIMER_TARGET0_INT_CLR    (BIT(0))
#define SYSTIMER_TARGET0_INT_CLR_M  (SYSTIMER_TARGET0_INT_CLR_V << SYSTIMER_TARGET0_INT_CLR_S)
#define SYSTIMER_TARGET0_INT_CLR_V  0x00000001
#define SYSTIMER_TARGET0_INT_CLR_S  0

/* SYSTIMER_INT_ST_REG register
 * systimer interrupt status register
 */

#define SYSTIMER_INT_ST_REG (DR_REG_SYSTIMER_BASE + 0x70)

/* SYSTIMER_TARGET2_INT_ST : RO; bitpos: [2]; default: 0;
 * interupt2 status
 */

#define SYSTIMER_TARGET2_INT_ST    (BIT(2))
#define SYSTIMER_TARGET2_INT_ST_M  (SYSTIMER_TARGET2_INT_ST_V << SYSTIMER_TARGET2_INT_ST_S)
#define SYSTIMER_TARGET2_INT_ST_V  0x00000001
#define SYSTIMER_TARGET2_INT_ST_S  2

/* SYSTIMER_TARGET1_INT_ST : RO; bitpos: [1]; default: 0;
 * interupt1 status
 */

#define SYSTIMER_TARGET1_INT_ST    (BIT(1))
#define SYSTIMER_TARGET1_INT_ST_M  (SYSTIMER_TARGET1_INT_ST_V << SYSTIMER_TARGET1_INT_ST_S)
#define SYSTIMER_TARGET1_INT_ST_V  0x00000001
#define SYSTIMER_TARGET1_INT_ST_S  1

/* SYSTIMER_TARGET0_INT_ST : RO; bitpos: [0]; default: 0;
 * interupt0 status
 */

#define SYSTIMER_TARGET0_INT_ST    (BIT(0))
#define SYSTIMER_TARGET0_INT_ST_M  (SYSTIMER_TARGET0_INT_ST_V << SYSTIMER_TARGET0_INT_ST_S)
#define SYSTIMER_TARGET0_INT_ST_V  0x00000001
#define SYSTIMER_TARGET0_INT_ST_S  0

/* SYSTIMER_REAL_TARGET0_LO_REG register
 * system timer comp0 actual target value low register
 */

#define SYSTIMER_REAL_TARGET0_LO_REG (DR_REG_SYSTIMER_BASE + 0x74)

/* SYSTIMER_TARGET0_LO_RO : RO; bitpos: [31:0]; default: 0;
 * actual target value value low 32bits
 */

#define SYSTIMER_TARGET0_LO_RO    0xffffffff
#define SYSTIMER_TARGET0_LO_RO_M  (SYSTIMER_TARGET0_LO_RO_V << SYSTIMER_TARGET0_LO_RO_S)
#define SYSTIMER_TARGET0_LO_RO_V  0xffffffff
#define SYSTIMER_TARGET0_LO_RO_S  0

/* SYSTIMER_REAL_TARGET0_HI_REG register
 * system timer comp0 actual target value high register
 */

#define SYSTIMER_REAL_TARGET0_HI_REG (DR_REG_SYSTIMER_BASE + 0x78)

/* SYSTIMER_TARGET0_HI_RO : RO; bitpos: [19:0]; default: 0;
 * actual target value value high 20bits
 */

